% V-6

%part 1


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ins f = f(x1,x2)
%  f1 = x2 = 0;
%  f2 = - gam*x(2) - x(1) / (1+x(1)^2) - 1/4 = 0;

% => explicit functions x2 = x2(x1)
%gam = -0.5;
%x2_1 = @(x1) x1.*0;
%x2_2 = @(x1) (- x1./(1+x1.^2) - 1/4) ./ gam;
%x1span = -20:0.01:20;
%
%hold on
%plot(x1span,x2_1(x2span));
%plot(x1span,x2_2(x2span));
%hold off
%точки пересечения (точки покоя): A{-3.7321, 0}, B{-0.26796, 0}
% расположение точек покоя не зависит от gam
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

gam = 0.2;   % Входные параметры
tspan = 0:0.2:200;  % Интервал интегрирования
func1 = @(t,x) odefun_v6(t, x, gam);  % Функция правых частей (для ode45())
opts = odeset('RelTol',1e-8,'AbsTol',1e-8);  % Задание опций


% Цикл по начальным условиям:
%x0 = [0, 0.1; 0, 0.5; 0.0, 1.0; 0.0, 2; 0.0, 5];   % Таблица начальных условий
x0 = [0, 0.1; 0, 0.5; 0.0, 1.0; -4, 0]
[nic, nc] = size(x0);  
hold on
for k = 1:nic
   % Решение системы ОДУ
   [t, xsol] = ode45(func1, tspan, x0(k,:), opts);
    plot(xsol(:,1), xsol(:,2))
    axis([-5,5,-5,5])
end
hold off
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%